# -*- coding: utf-8 -*-

""" Модуль для добавления инградиентов в бургер:
#  - булочки # - buns
#  - котлеты # - cutlets
#  - огурчики # - cucumbers
#  - помидорчики # - tomatoes
#  - майонезик # - mayonnais
#  - сыр # - cheese """


def buns():  # функция булок
    print(f"Сначала возьмем Булочки для гамбургеров, поджаренные в тостере")


def cutlets():  # функция котлетосов
    print(f"И теперь добавим Бифштексы из говядины рубленые, приготовленные на гриле")


def cucumbers():  # функция огуречиков
    print(f"А сейчас добавим Огурцы маринованные резанные")


def tomatoes():  # функция  помидорок
    print(f"Накидаем помидорок")


def mayonnais():  # функция мазика
    print(f"И зальем все мазиком")


def cheese():  # функция сырочечка
    print(f"Покладем чуток Плавленый сыр Чеддер =)")


def mustard_sauce():
    print(f"добавим Горчичный соус")


def fresh_onion():
    print(f"Лук репчатый свежий резаный")
